app/controllers/main_controller.rb

  def actualizar_orden
    if params[:placa]
      @vehiculo = Vehiculo.find_by_placa(params[:placa].upcase)
---
SELECT "vehiculos".* FROM "vehiculos" WHERE ("vehiculos"."placa" = '122brw') LIMIT 1

  def orden_add
    @orden = Orden.find( params[:orden_id] )
    @ordendetalle = Ordendetalle.find(params[:orden_detalle_id])

    if params[:nombre_repuesto]
      nombre = params[:nombre_repuesto].tr(' ','+')

      url_repuesto = "http://localhost:3001/consultarrepuestos/#{nombre}.xml"

     repuestos_doc = Nokogiri::XML(open(url_repuesto))
     repuestos_nodos = repuestos_doc.css("repuesto")

      @repuestos = []
      repuestos_nodos.each do |repuesto|
          @repuestos <<  {:repuesto_id => repuesto.css('repuesto_id').text, :nombre => repuesto.css('nombre').text}
      end
    elsif params[:repuesto_id]
      @ordendetalle.serviciorepuestos << Serviciorepuesto.new(:repuesto_id => params[:repuesto_id],
                                                              :cantidad => 1,
                                                              :costo => 1,
                                                              :nombre => params[:nombre].tr('+',' '))
---
SELECT "ordendetalles".* FROM "ordendetalles" WHERE ("ordendetalles"."id" = 1) LIMIT 1
INSERT INTO "serviciorepuestos" ("cantidad", "costo", "created_at", "nombre", "orden_detalle_id", "repuesto_id", "updated_at") VALUES (1, 1.0, '2010-11-16 21:11:19.081354', 'Llanta Radial Ring 12', 1, 13, '2010-11-16 21:11:19.081354')

  def orden_destroy
    @orden = Orden.find( params[:orden_id] )
    @ordendetalle = Ordendetalle.find(params[:orden_detalle_id])

    Serviciorepuesto.find(params[:repuesto_id]).destroy
---
SELECT "ordendetalles".* FROM "ordendetalles" WHERE ("ordendetalles"."id" = 1) LIMIT 1
DELETE FROM "serviciorepuestos" WHERE ("serviciorepuestos"."id" = 3)
SELECT "serviciorepuestos".* FROM "serviciorepuestos" WHERE ("serviciorepuestos"."id" = 3) LIMIT 1

  def create_orden
    i_cita_id = params[:cita_id]

    @cita = Cita.where("id = ?", i_cita_id)
    if @cita.empty?
      @error_code = 500
      @error_description = "Numero de cita invalido"
    else
      #buscar si ya existe
      @orden = Orden.where(:cita_id => @cita[0].id)

      if @orden.empty?
        #crear orden
        @orden = Orden.new(:cita_id => @cita[0].id,
                           :estado_id => Orden::ESTADO_RECIBIDO)

        unless @orden.save
---
SELECT "citas".* FROM "citas" WHERE (id = '1')
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "citas" WHERE (id = '1')) AS subquery
INSERT INTO "ordenes" ("cita_id", "created_at", "estado_id", "updated_at") VALUES (1, '2010-11-16 19:01:00.811471', 1, '2010-11-16 19:01:00.811471')

  def create_cita

    c_placa = params[:placa].upcase
    c_fecha = params[:fecha]
    c_hora = params[:hora]

    # buscar si vehiculo existe
    @vehiculo = Vehiculo.find_by_placa(c_placa)

    if @vehiculo.nil?
      #crear nuevo vehiculo
      @vehiculo = Vehiculo.new(:placa => c_placa)
      unless @vehiculo.save
        @error_code = 500
        @error_description = "Error al crear vehiculo. #{@vehiculo.errors}"
      end
    end

    @cita = Cita.new(:fecha => Date.parse(c_fecha),
                     :hora => c_hora.to_i,
                     :cliente_id => @vehiculo.id,
                     :estados_id => 1)

    unless @cita.save
---
SELECT "vehiculos"."id" FROM "vehiculos" WHERE ("vehiculos"."placa" = '122BWR') LIMIT 1
INSERT INTO "vehiculos" ("created_at", "placa", "updated_at") VALUES ('2010-11-16 18:59:56.478307', '122BWR', '2010-11-16 18:59:56.478307')
INSERT INTO "citas" ("cliente_id", "created_at", "estados_id", "fecha", "hora", "updated_at") VALUES (1, '2010-11-16 18:59:56.705679', 1, '2010-11-16', 15, '2010-11-16 18:59:56.705679')

  def find_cita
    d_fecha = Date.parse(params[:fecha])

    unless params[:hora].nil?
      i_hora = params[:hora].to_s
      # i_hora = params[:hora].to_i
      citas = Cita.where("fecha = ? and hora = ?", d_fecha, i_hora)
---
SELECT "citas"."id" FROM "citas" WHERE ("citas"."fecha" = '2010-11-16') AND ("citas"."hora" = 15) LIMIT 1